
Процедура РассчитатьСебестоимость() Экспорт 
	НачалоРасчетаСебестоимости = Константы.НачалоРасчетаСебестоимости.Получить();
	Если НачалоРасчетаСебестоимости = Дата(1, 1, 1) Тогда 
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваров.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваров КАК РеализацияТоваров
		|ГДЕ
		|	РеализацияТоваров.Дата >= &Дата
		|	И РеализацияТоваров.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияТоваров.МоментВремени";
	
	Запрос.УстановитьПараметр("Дата", НачалоРасчетаСебестоимости);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументРеализации = Выборка.Ссылка.ПолучитьОбъект();
		Константы.НачалоРасчетаСебестоимости.Установить(ДокументРеализации.МоментВремени().Дата);
		ДокументРеализации.ДополнительныеСвойства.Вставить("Состояние", "РасчетСебестоимости");
		ДокументРеализации.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	КонецЦикла;
	Константы.НачалоРасчетаСебестоимости.Установить(Дата(1, 1, 1));
КонецПроцедуры
 