
Процедура ОбработкаПроведения(Отказ, Режим)
	// Формирую движения
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ОстаткиТоваров.Очистить();
	Движения.ОстаткиТоваров.БлокироватьДляИзменения = Истина;
	
	Для каждого СтрТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = СтрТовары.Номенклатура;
		Движение.Количество = СтрТовары.Количество;
	КонецЦикла;
	
	// Записываю движения и проверяю остаток
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровТовары.Номенклатура,
		|	МИНИМУМ(РеализацияТоваровТовары.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ втТоварыДокумента
		|ИЗ
		|	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|ГДЕ
		|	РеализацияТоваровТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТоварыДокумента.НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕ(ОстаткиТоваровОстатки.Номенклатура) КАК НоменклатураПредставление,
		|	ОстаткиТоваровОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(
		|			&Период,
		|			Номенклатура В
		|				(ВЫБРАТЬ
		|					втТоварыДокумента.Номенклатура
		|				ИЗ
		|					втТоварыДокумента КАК втТоварыДокумента)) КАК ОстаткиТоваровОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ втТоварыДокумента КАК втТоварыДокумента
		|		ПО ОстаткиТоваровОстатки.Номенклатура = втТоварыДокумента.Номенклатура
		|ГДЕ
		|	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Отказ = Истина;
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не хватает " + Выборка.КоличествоОстаток + " номенклатуры """ + Выборка.НоменклатураПредставление + """ в строке " + Выборка.НомерСтроки;
			Сообщение.Поле = "Товары[" + Строка(Выборка.НомерСтроки - 1) + "].Количество";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить(); 
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
